blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES ('New Dev', 'This is a new article', '2024-11-21 01:47:11.121633', '2024-11-21 01:47:11.121633', 'archived') RETURNING "id"
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 2 LIMIT 1
UPDATE "articles" SET "body" = 'WOWWOWOWOWEEEE', "updated_at" = '2024-11-21 01:26:34.121602' WHERE "articles"."id" = 2
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)