blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 4 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES ('A fellow dev', 'HELLO', 4, '2024-11-21 01:46:07.769105', '2024-11-21 01:46:07.769105', 'public') RETURNING "id"